note/MATH/Matrices.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-17 Tue 08:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Theory of Matrices</title>
<meta name="author" content="Aryan Pandey" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../worg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Theory of Matrices</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org597bf42">1. Eigen values and Eigen vectors</a></li>
<li><a href="#orgec53c96">2. Cayley-Hamilton Theorem</a></li>
<li><a href="#org0f39550">3. Similarity of Matrices</a>
<ul>
<li><a href="#org38fcef0">3.1. Algebraic and Geometric Multiplicity of an Eignevalue</a>
<ul>
<li><a href="#org303e2f6">3.1.1. Algebraic Multiplicity</a></li>
<li><a href="#orgdd0d9dc">3.1.2. Geometric Multiplicity</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd2e8c81">4. Diagonalising and Non-Diagonalising Matrix</a>
<ul>
<li><a href="#org81ab91b">4.1. Diagonalising a Given Matrix</a>
<ul>
<li><a href="#org04b9c78">4.1.1. (a) Distinct Eigenvalues</a></li>
<li><a href="#org628af2c">4.1.2. (b) Repeated Eigenvalues</a></li>
</ul>
</li>
<li><a href="#org40a6e18">4.2. Non-Diagonalising Matrix</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org597bf42" class="outline-2">
<h2 id="org597bf42"><span class="section-number-2">1.</span> Eigen values and Eigen vectors</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Sum of diagonal elements = Sum of eigen values.</li>
</ul>
\begin{equation}
| A - \lambda I | = 0 ... Characteristic Equation
\end{equation}
\begin{equation}
\lambda^3-[sum of diagonal elements]\lambda^2+[sum of minor of diagonal elements]\lambda-|A|=0
\end{equation}
\begin{equation}
\lambda=x,y,z \\
\end{equation}
<ul class="org-ul">
<li>Put lambda value in the matrices</li>
</ul>
\begin{equation}
\left(
 \begin{matrix}
  a-\lambda & b & c \\
  d & e-\lambda & f \\
  g & h & i-\lambda 
 \end{matrix}
 \right)
 \begin{matrix}
  x_1\\
  x_2\\
  x_3 
 \end{matrix}
=
 \begin{matrix}
  0\\
  0\\
  0 
 \end{matrix}
 \end{equation}
 \begin{equation}
ax_1+bx_2+cx_3=0 \\
dx_1+ex_2+fx_3=0 \\
gx_1+hx_2+ix_3=0 \\
 \end{equation}
<ul class="org-ul">
<li>Cramer rule can only be in that value which is not repeated</li>
</ul>
\begin{equation}
\frac{x_1}{minorofequation}=\frac{x_2}{minorofequation}=\frac{x_3}{minorofequation}
\end{equation}
</div>
</div>
<div id="outline-container-orgec53c96" class="outline-2">
<h2 id="orgec53c96"><span class="section-number-2">2.</span> Cayley-Hamilton Theorem</h2>
<div class="outline-text-2" id="text-2">
\begin{equation}
| A - \lambda I | = 0 ... Characteristic Equation \\
\end{equation}
\begin{equation}
\lambda^3-[sum of diagonal elements]\lambda^2+[sum of minor of diagonal elements]\lambda-|A|=0
\end{equation}
<ul class="org-ul">
<li>Now put instead of &lambda;.</li>
</ul>
<p>
\(A^3-[sum of diagonal elements]A^2+[sum of minor of diagonal
elements]A-|A|=0\)
</p>
</div>
</div>
<div id="outline-container-org0f39550" class="outline-2">
<h2 id="org0f39550"><span class="section-number-2">3.</span> Similarity of Matrices</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org38fcef0" class="outline-3">
<h3 id="org38fcef0"><span class="section-number-3">3.1.</span> Algebraic and Geometric Multiplicity of an Eignevalue</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org303e2f6" class="outline-4">
<h4 id="org303e2f6"><span class="section-number-4">3.1.1.</span> Algebraic Multiplicity</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>If an eignevalue &lambda;<sub>1</sub> of matrix <i>A</i> is repeated <i>t</i> times the
<i>t</i> is called the <b>algebraic multiplicity</b> of &lambda;<sub>1</sub>.</li>
</ul>
</div>
</div>
<div id="outline-container-orgdd0d9dc" class="outline-4">
<h4 id="orgdd0d9dc"><span class="section-number-4">3.1.2.</span> Geometric Multiplicity</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>If corresponding to an eigenvalue &lambda;<sub>1</sub>, there are <i>s</i> linearly
independent eigenvectors the <i>s</i> is called the <b>geometric
multiplicity</b> of &lambda;<sub>1</sub></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd2e8c81" class="outline-2">
<h2 id="orgd2e8c81"><span class="section-number-2">4.</span> Diagonalising and Non-Diagonalising Matrix</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org81ab91b" class="outline-3">
<h3 id="org81ab91b"><span class="section-number-3">4.1.</span> Diagonalising a Given Matrix</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org04b9c78" class="outline-4">
<h4 id="org04b9c78"><span class="section-number-4">4.1.1.</span> (a) Distinct Eigenvalues</h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li>If all eignevalues are distinct the matrix is <b>Diagonalisable</b></li>
<li>If \(X_1,X_2,X_3\) then \(M=[X_1, X_2, X_3]\) is the <b>transforming matrix</b></li>
<li><p>
If \(\lambda_1, \lambda_2, \lambda_3\) are the distinct eigenvalues
then the diagonal matrix <code>D</code> is
</p>
\begin{matrix}
 \lambda_1 & 0 & 0 \\
 0 & \lambda_2 & 0 \\
 0 & 0 & \lambda_3
\end{matrix}</li>
<li>\(M^{-1}AM=D\) This shows that <code>M</code> diagonalises <code>A</code> to diagonal matrix
<code>D</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-org628af2c" class="outline-4">
<h4 id="org628af2c"><span class="section-number-4">4.1.2.</span> (b) Repeated Eigenvalues</h4>
<div class="outline-text-4" id="text-4-1-2">
<ol class="org-ol">
<li>If an eigenvalue &lambda; is repeated 't' times then its <b>algebraic
multiplicity</b> is 't'.</li>
<li>If there are 's' linearly independent eigenvectors then the
<b>geometric multiplicity</b> of &lambda; is 's'.</li>
<li>If \(t=s\) then the matrix is <b>diagonalisable</b>.</li>
<li>Rest is same as above.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org40a6e18" class="outline-3">
<h3 id="org40a6e18"><span class="section-number-3">4.2.</span> Non-Diagonalising Matrix</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>If the algebraic multiplicity of &lambda; is <b>not equal</b> the
geometric multiplicity, then the matrix <code>A</code> is <b>not diagonalisable</b>.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Aryan Pandey</p>
<p class="date">Created: 2022-05-17 Tue 08:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
